tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "liamg/tfsec"
brew "ansible", link: false
brew "awscli"
brew "checkov"
brew "dos2unix"
brew "gh"
brew "git"
brew "gnuplot"
brew "go"
brew "graphviz"
brew "jq"
brew "keychain"
brew "markdown"
brew "node"
brew "nvm"
brew "oath-toolkit"
brew "pandoc"
brew "parallel"
brew "pipenv"
brew "pre-commit"
brew "shellcheck"
brew "terraform-docs"
brew "terraform_landscape"
brew "terragrunt", args: ["ignore-dependencies"]
brew "tfenv"
brew "tflint"
brew "tree"
brew "yq"
brew "zplug"
brew "liamg/tfsec/tfsec"
cask "aws-vault"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "slack"
cask "spotify"
cask "zoom"
