tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
brew "awscli"
brew "gh"
brew "git"
brew "jq"
brew "oath-toolkit"
brew "pipenv"
brew "pre-commit"
brew "terraform_landscape"
brew "terragrunt", args: ["ignore-dependencies"]
brew "tfenv"
cask "aws-vault"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "slack"
cask "spotify"
cask "zoom"
